Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། མཚན་མོའི་ལྷ་མོ་འགྲོ་བ་ཐམས་ཅད་བསྲུང་བའི་སྨོན་ལམ་ལ་བརྩོན་པའི་འོད་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་རྣམ་པར་ཐར་པ་འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་ལ་ཡང་དག་པར་བསྐུལ་བའི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་འབྱུང་བ་ཞེས་བྱ་བ་སྟེ།
en: The night goddess Sarva­jagad­rakṣā­praṇidhāna­vīrya­prabhā said to Sudhana, the head merchant’s son, “Noble one, this liberation is called the origin of the roots of merit that inspire the ripening of all beings

source: རིགས་ཀྱི་བུ་ཁོ་མོ་རྣམ་པར་ཐར་པ་འདི་དང་ལྡན་པས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་དེ་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ལ་ཞུགས་ནས།
en: Noble one, through possessing this liberation, having realized the equal nature of all phenomena, having comprehended the nature of all phenomena, and having relied on the Dharma that has no location, I have risen above all worlds, understood the differentiation of the forms of all phenomena, and, understanding the true nature that has no distinct color, no variation of color, no separate aspect of color, no concept of color, no blue color, no yellow color, no red color, no white color, no dissimilarities, no variety, no different aspects, no concepts, no blue, no yellow, no red, and no white colors, I have form bodies of many categories of color; various kinds of color; numerous colors;

source: གནས་མེད་པའི་ཆོས་ལ་བརྟེན་ཏེ།
en: countless colors; pure colors; every display of manifested colors; all-illuminating colors; colors that resemble those of all beings;

source: འཇིག་རྟེན་ཐམས་ཅད་ལས་འཕགས་པར་གྱུར་ཏོ།
en: colors that manifest and are superior in all worlds;

source: །ཆོས་རྣམས་ཀྱི་གཟུགས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་ལ་ཞུགས་ཏེ།
en: colors of completely illuminated images;

source: མི་འདྲ་བ་མེད་པའི་ཁ་དོག་དང་། སྣ་ཚོགས་མེད་པའི་ཁ་དོག་དང་། རྣམ་པར་ཐ་དད་པ་མྱེད་པའི་ཁ་དོག་དང་། མི་རྟོག་པའི་ཁ་དོག་དང་། མི་སྔོ་བའི་ཁ་དོག་དང་། མི་སེར་བའི་ཁ་དོག་དང་། མི་དམར་བའི་ཁ་དོག་དང་། མི་དཀར་བའི་ཁ་དོག་དང་། མི་འཐུན་པ་མེད་པ་དང་། སྣ་ཚོགས་མེད་པ་དང་། རྣམ་པ་ཐ་དད་པ་མེད་པ་དང་། རྟོག་པ་མེད་པ་དང་། མི་སྔོ་བ་དང་མི་སེར་བ་དང་། མི་དམར་བ་དང་མི་དཀར་བའི་ཁ་དོག་གི་ཆོས་ཉིད་ལ་ཞུགས་ནས་ཁ་དོག་རྣམ་པར་ཕྱེ་བ་དུ་མའི་གཟུགས་ཀྱི་ལུས་སྣ་ཚོགས་ཀྱི་ཁ་དོག་ཅན།
en: colors that are not inimical; the colors of the completely purified signs and features of a great being; colors that have the light of nontransgressive conduct; colors that manifest prowess through great strength; profound colors that are difficult to attain; colors that the entire world cannot defeat;

source: ཁ་དོག་དུ་མ་དང་ཁ་དོག་ཚད་མེད་པ་དང་། ཁ་དོག་རྣམ་པར་དག་པ་དང་རྒྱན་ཐམས་ཅད་འབྱིན་པའི་ཁ་དོག་དང་ཀུན་ཏུ་སྣང་བའི་ཁ་དོག་དང་། འགྲོ་བ་ཐམས་ཅད་དང་འདྲ་བའི་ཁ་དོག་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་ཅིང་ལྷག་པའི་ཁ་དོག་དང་གཟུགས་བརྙན་ཀུན་ཏུ་སྣང་བའི་ཁ་དོག་དང་། མི་འཐུན་པ་མེད་པའི་ཁ་དོག་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོས་རྣམ་པར་སྦྱངས་པའི་ཁ་དོག་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པར་སྤྱོད་པའི་འོད་དང་ལྡན་པའི་ཁ་དོག་དང་། སྟོབས་ཆེན་པོས་རྣམ་པར་གནོན་པ་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། ཟབ་མོ་ཐོབ་པར་དཀའ་བའི་ཁ་དོག་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མི་ཐུབ་པའི་ཁ་དོག་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཚིག་གིས་མི་ཟད་པའི་ཁ་དོག་དང་། སྐད་ཅིག་རེ་རེ་ལ་སྣ་ཚོགས་སུ་འགྱུར་བའི་ཁ་དོག་དང་། ཁ་དོག་གི་སྤྲིན་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། གཟུགས་དང་དབྱིབས་སྣ་ཚོགས་ཀྱི་ཁ་དོག་དང་། རྣམ་པར་འཕྲུལ་པ་ཚད་མེད་པ་སྟོན་པའི་ཁ་དོག་དང་། ཤིན་ཏུ་ཡིད་དུ་འོང་ཞིང་རྣམ་པར་སྣང་བའི་ཁ་དོག་དང་། བཟང་པོ་དང་མཛེས་པ་ཐམས་ཅད་འབེལ་བའི་ཁ་དོག་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། མཐུན་པའི་ཁ་དོག་དང་། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འདུལ་བ་ལ་མངོན་ཏུ་འགྱུར་བའི་དགེ་བའི་ཁ་དོག་དང་། ཐོགས་པ་མེད་པར་ཀུན་ཏུ་སྣང་བའི་ཁ་དོག་དང་། དང་ཞིང་རྙོག་པ་མེད་ལ་རྣམ་པར་གསལ་ཏེ།
en: colors that cannot be exhausted by the words of all beings; colors that vary with each instant; colors that are the manifestations of various clouds of colors; colors in various forms and shapes; the colors of the appearance of countless miraculous manifestations; beautiful, shining colors; colors that increase all excellence and beauty; colors that accord with the ripening of all beings; colors of goodness that directly manifest to guide beings according to their aspirations; colors that illuminate without obscuration; pure and unsullied colors of pure brightness; colors that manifest countless ways of the Dharma; unsurpassable colors that surpass and overwhelm all; colors that have no darkness or dimness; colors that are accomplished through all goodness; colors that are an ocean of qualities of greatness; colors created by past veneration of gurus;

source: འོད་དང་བའི་ཁ་དོག་དང་། མི་ཤེས་པའི་ལུས་ཀྱིས་བསྒྲུབས་པས་མཛེས་པར་གྱུར་པའི་ཁ་དོག་དང་། ཆོས་ཀྱི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་རབ་ཏུ་སྟོན་པའི་ཁ་དོག་དང་། ཟིལ་གྱིས་གནོན་ལ་ཟིལ་གྱིས་གནོན་པས་ཐམས་ཅད་ཟིལ་དུ་རླག་པར་བྱེད་པའི་ཁ་དོག་དང་། མུན་པ་དང་རབ་རིབ་མེད་པའི་ཁ་དོག་དང་། མུན་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བའི་ཁ་དོག་དང་། དཀར་པོ་ཐམས་ཅད་ཤིན་ཏུ་བསྒྲུབས་པའི་ཁ་དོག་དང་། བདག་ཉིད་ཆེ་བའི་ཡོན་ཏན་རྒྱ་མཚོའི་ཁ་དོག་དང་། སྔོན་བླ་མ་ལ་རིམ་གྲོར་བྱས་པས་ཤིན་ཏུ་བསྒྲུབས་པའི་ཁ་དོག་དང་། ལྷག་པའི་བསམ་པའི་ནམ་མཁའ་ཡོངས་སུ་དག་པར་བྱེད་པའི་ཁ་དོག་དང་། མཆོག་དམ་པ་ཕུལ་དུ་བྱུང་བར་ཤིན་ཏུ་ཡངས་པའི་ཁ་དོག་དང་། མི་འཕྲོགས་མི་ཟད་པའི་ཡོན་ཏན་རྒྱ་མཚོ་རབ་ཏུ་སྟོན་པའི་ཁ་དོག་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལ་མི་གནས་ཤིང་མ་འདྲེས་པའི་ཁ་དོག་དང་། ཐོགས་པ་མེད་པར་ཕྱོགས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པའི་ཁ་དོག་དང་། སེམས་ཅན་ཀྱི་སྐད་ཅིག་འབྱམ་ཀླས་པ་ལ་ཞིང་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པར་ཁ་དོག་སྣ་ཚོགས་རྣམ་པ་དུ་མ་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགའ་བའི་ཤུགས་ཆེན་པོ་རྣམ་པར་འཕེལ་བར་བྱེད་པའི་ཁ་དོག་དང་། སེམས་ཅན་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པའི་ཁ་དོག་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོ་མ་ལུས་པའི་སྤྲིན་གྱི་སྒྲ་སྒྲོག་པའི་ཁ་དོག་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་། མོས་པ་རྒྱ་མཚོ་རྣམ་པར་སྦྱོང་བའི་ཁ་དོག་དང་། ཆོས་ཐམས་ཅད་ཀྱི་དོན་རྣམ་པར་གདོན་མི་ཟ་བ་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། འོད་གཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་ཁ་དོག་སྣ་ཚོགས་སུ་སྣང་བའི་ཁ་དོག་དང་། ནམ་མཁའ་ལྟར་དྲི་མ་མེད་པར་སྣང་བའི་ཁ་དོག་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་རྣམ་པར་དག་པ་ལྟར་རྡུལ་གྱི་དྲི་མ་མེད་པའི་འོད་ལ་གནས་པའི་ཁ་དོག་དང་། ཆོས་ཉིད་དྲི་མ་མྱེད་པའི་འོད་ཀྱི་ཁ་དོག་དང་། ཁ་དོག་དཔག་ཏུ་མེད་པའི་ཚུལ་རྒྱ་མཚོ་རྣམ་པ་ཐ་དད་པ་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། ཕྱོགས་ཀུན་ཏུ་སྣང་བར་བྱེད་པའི་ཁ་དོག་དང་། དུས་ལ་གང་དུ་བབ་པར་འགྲོ་བ་ཡོངས་སུ་སྟོན་པར་མ་འདྲེས་པའི་ཁ་དོག་དང་། ཞི་བ་དང་དུལ་བའི་ཕྱོགས་ལས་བྱུང་བའི་ཁ་དོག་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའི་ཁ་དོག་དང་། འགྲོ་བ་བསོད་ནམས་ཀྱི་ཞིང་ཐམས་ཅད་ལ་རབ་ཏུ་སྟོན་པའི་ཁ་དོག་དང་། འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་སེལ་བའི་ཁ་དོག་དང་། དོན་ཡོད་པར་འགྲོ་བ་རྒྱས་པར་འགེངས་པའི་ཁ་དོག་དང་། ཡེ་ཤེས་ཀྱི་རྣམ་པར་གནོན་པ་ཆེན་པོ་རབ་ཏུ་རྗོད་པའི་ཁ་དོག་དང་། ཆགས་པ་མེད་པའི་ལུས་ཀྱིས་ཀུན་ཏུ་རྒྱས་པར་འགེངས་པའི་ཁ་དོག་དང་། ལུས་དམ་པའི་སྤྲིན་གྱི་དབྱངས་ཀྱིས་འགྲོ་བ་ཀུན་ཏུ་སྟོན་པར་བྱེད་པའི་ཁ་དོག་དང་། བྱམས་པའི་རྒྱ་མཚོ་ཆེན་པོ་ཡོངས་སུ་སྡུད་པའི་ཁ་དོག་དང་། བསོད་ནམས་ཀྱི་རི་རབ་ཆེན་པོ་ཡོངས་སུ་སྒྲུབ་པའི་ཁ་དོག་དང་། འགྲོ་བ་ཐམས་ཅད་དུ་མི་གནས་ཀྱང་འཇིག་རྟེན་གྱི་རྒྱུད་ཐམས་ཅད་དུ་གཟུགས་བརྙན་འབྱུང་བའི་ཁ་དོག་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་ཆེན་པོ་རྣམ་པར་སྦྱོང་བའི་ཁ་དོག་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་རྗེས་སུ་དྲན་པ་དང་། འགྲོགས་པའི་ཁ་དོག་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ལྟ་བུའི་ཁ་དོག་དང་། རྣམ་པར་སྣང་བའི་སྙིང་པོ་ལྟར་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་མོས་པའི་ཚུལ་དང་མཐུན་པའི་ཁ་དོག་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྣམ་པ་ལ་མངོན་དུ་གྱུར་པའི་ཁ་དོག་དང་། མིག་འཛུམ་གྱིས་རྒྱས་པས་འགྲོ་བ་མོས་པར་བྱེད་པའི་ཁ་དོག་དང་། རིན་པོ་ཆེའི་རྒྱན་དམ་པའི་འོད་ཀྱི་ཁ་དོག་དང་། འགྲོ་བ་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པ་ལ་ཕྱིར་ཕྱོགས་པ་མེད་པའི་ཁ་དོག་དང་། ངེས་པ་མེད་ཅིང་མངོན་པར་ཞེན་པ་མེད་པའི་ཁ་དོག་དང་། བྱིན་གྱི་རླབས་ཀྱིས་རྣམ་པར་འཕྲུལ་པའི་ཁྱུ་མཆོག་གི་མཐུ་འབྱིན་པ་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། རྫུ་འཕྲུལ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་འཕྲུལ་པའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། དེ་བཞིན་གཤེགས་པའི་དགེ་བའི་རྩ་བ་སྣང་བར་བྱེད་པའི་ཁ་དོག་དང་། ཆོས་ཀྱི་དབྱིངས་ཁ་ན་མ་ཐོ་བ་མེད་པའི་ཚུལ་རྒྱུ་མཚོ་ལ་རབ་ཏུ་ཞུགས་པའི་ཁ་དོག་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་འབྱུང་བའི་ཁ་དོག་དང་། ཁ་དོག་སྣ་ཚོགས་རྒྱ་མཚོ་རབ་ཏུ་སྒྲུབ་པའི་ཁ་དོག་དང་། ལེགས་པར་སྤྱད་པ་དང་། རྒྱུ་འཐུན་པ་བཟང་པོས་བྱུང་བའི་ཁ་དོག་དང་། འདུལ་བ་ཇི་ལྟ་བ་བཞིན་དུ་ཉེ་བར་སྒྲུབ་པའི་ཁ་དོག་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་བལྟ་ན་མི་ངོམས་པའི་ཁ་དོག་དང་། འོད་དང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་འོད་དུ་སྣང་བའི་ཁ་དོག་དང་། དུས་གསུམ་གྱི་ཁ་དོག་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་བསྟན་པའི་ཁ་དོག་དང་། འོད་གཟེར་ཁ་དོག་ཐམས་ཅད་དང་ལྡན་པ་རྒྱ་མཚོ་རབ་དུ་འགྱེད་པའི་ཁ་དོག་དང་། འོད་ཀྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཁ་དོག་བརྗོད་དུ་མེད་པ་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པ་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། སྤོས་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བ་ཀུན་ལས་འདས་པའི་ཁ་དོག་དང་། བ་སྤུའི་སྒོ་རེ་རེ་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཉི་མའི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། ཟླ་བའི་དཀྱིལ་འཁོར་གྱི་གཟུགས་དྲི་མ་མེད་ཅིང་ཡངས་པའི་སྤྲིན་གྱི་བྱིན་གྱི་རླབས་ཀྱི་ཁ་དོག་དང་། མེ་ཏོག་ཡིད་དུ་འོང་བའི་རི་རབ་ཀྱི་སྤྲིན་མཐའ་ཡས་པ་རབ་ཏུ་འགྱེད་པའི་ཁ་དོག་དང་། ཕྲེང་བ་སྣ་ཚོགས་མངོན་པར་སྒྲུབ་པའི་ཤིང་གི་སྤྲིན་གྱི་ཕྲེང་བ་ཐམས་ཅད་ཀྱི་ཆར་རབ་ཏུ་འབེབས་པའི་ཁ་དོག་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་པདྨོའི་སྤྲིན་ཡོངས་སུ་སྟོན་པའི་ཁ་དོག་དང་། སྤོས་དང་བདུག་སྤོས་ཐམས་ཅད་ཀྱི་ན་བུན་གྱི་གཟུགས་ཀྱི་སྤྲིན་གྱིས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པའི་ཁ་དོག་དུ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཕྱེ་མའི་མཛོད་ཀྱི་སྤྲིན་ཐམས་ཅད་བྱིན་གྱིས་བརླབས་ཤིང་།
en: colors that create the pure space of superior motivation; colors that are perfect, sublime, wonderful, and vast; colors that manifest an ocean of insuperable, inexhaustible qualities; colors that do not dwell in and are not mixed in with the world; colors that pervade all directions without impediment; colors that manifest the numerous varieties of the colors of the vast extent of countless realms in each instant; colors that increase the great power of joy in all beings; colors that gather together all the great ocean of beings; colors that resound with clouds of the entire ocean of qualities of the buddhas within every pore; colors that purify the ocean of wishes and aspirations of all beings; colors that teach with certainty all Dharmas; colors that shine with multicolored fields of networks of light rays; colors with a stainless radiance like space; colors that are based on lights unstained by dust that are like pure kings of jewels; colors of the lights of the stainless true nature; colors that manifest the ocean of the different ways of countless colors; colors that illuminate all directions; distinct colors that are revealed to beings at the appropriate times; colors that arise from the direction of pacification and self-control; colors that pacify all kleśas; colors that are revealed within all the fields of merit of beings; colors that dispel all fears; colors that efficaciously spread among beings; colors that promulgate the great prowess of wisdom; colors of the complete pervasion of the unimpeded body; colors that reveal everywhere to beings realms of clouds of excellent bodies; colors that gather an ocean of great love; colors that accomplish a great Sumeru of merit; colors from which arise images within the existences of worlds while not being dependent on beings; colors that purify the great strength of wisdom; colors that remember and accompany all worlds; colors like those of all jewels; colors that manifest the essence of brightness; colors that accord with the aspiration of all beings; colors that make perceivable the outer aspect of omniscience; colors that inspire beings through greatly delighting the eyes; colors of the lights of an excellent array of jewels; colors that without impediment are never turned away from all beings; colors that are not fixed and have no attachment; colors that manifest the rising of the power of the supremacy of manifestations through blessings; colors that manifest the rising of the power of the supremacy of manifestations through all miraculous powers; colors that illuminate the roots of merit of the tathāgatas; colors that spread into an ocean of the ways of the realm of all Dharmas free of transgressions; colors from which arise images that enter the circles of followers of all the buddhas; colors that accomplish an ocean of various colors; colors that arise from excellent conduct and good appropriate causes; colors that accomplish whatever accords with guidance; colors that the entire world never tires of looking at; colors that shine with pure light in the form of lights of many colors; colors that reveal the entire ocean of colors in the three times; colors that spread an ocean that has light rays of all colors; colors that reveal an ocean of fields of light with countless different kinds of various colors; colors that transcend all the lights emanated by all incenses; colors from each pore that manifest clouds of sun disks that are as numerous as the atoms in countless buddha realms;

source: ཕྱོགས་བཅུར་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་རྒྱས་པར་བཀང་ནས་མཐོང་བས་འདུལ་བའི་སེམས་ཅན་རྣམས་དང་། ཐོས་པས་འདུལ་བ་དང་། རྗེས་སུ་དྲན་པས་འདུལ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་སྤྲུལ་པ་མངོན་པར་བསྒྲུབས་པས་འདུལ་བ་དང་། ཡོངས་སུ་སྨྱིན་པར་འགྱུར་བའི་དུས་ལ་བབ་པས་འདུལ་བར་གྱུར་བ་དང་། གཟུགས་ཀྱི་ལུས་ཡོངས་སུ་བསྟན་པས་འདུལ་བ་དང་། བསྙེན་བཀུར་བྱ་བས་འདུལ་བ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བས་འདུལ་བ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་སྣ་ཚོགས་ཡོངས་སུ་བསྟན་པས་འདུལ་བ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམ་པར་དམྱིགས་པ་ཡོངས་སུ་བསྟན་པས་བཏུལ་བའི་སེམས་ཅན་རྣམས་ཀྱི་བསམ་བའི་དབང་དང་། དུས་ཀྱི་དབང་དང་། མི་དགེ་བའི་ལས་ལས་རྣམ་པར་བཟློག་པའི་དབང་དང་། དགེ་བའི་ལམ་ཡོངས་སུ་བསྒྲུབ་པ་ལ་སོ་སོར་འགོད་པའི་དབང་དང་། སྔོན་སྨོན་ལམ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་པའི་དབང་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤུགས་ཀྱི་དབང་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་རྒྱ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པ་རབ་ཏུ་ཐོབ་པའི་ཆོས་ཀྱི་དབང་དང་། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པར་ཤིན་ཏུ་བསྒྲུབས་པའི་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ཡོངས་སུ་འབྱུང་བའི་དབང་དང་། བྱམས་པ་ཆེན་པོའི་རྒྱ་མཚོ་རྣམ་པར་དག་པ་ཡོངས་སུ་བསྐྱེད་པའི་བསམ་པའི་དབང་གིས།
en: colors that have the blessing of vast clouds of the stainless forms of the disks of the moon; colors that spread infinite clouds of Sumerus of beautiful flowers; colors that send down rain from cloud banks of trees created from various garlands; colors that manifest clouds of lotuses made of all jewels; and colors that spread clouds formed from the mist of all perfumes and incenses throughout the entire realm of phenomena, which in each instant of mind are blessed as clouds of all treasures of powders and pervade throughout the ten directions of the ocean of the ways of the entire realm of phenomena, and through having acquired the blessing of the tathāgatas I manifest to beings who are guided through seeing, who are guided through hearing, who are guided through remembering, who are guided through creating emanations of Dharma wheels, who are guided through the time having come for their ripening, who are guided through the manifestation of form bodies, who are guided through acts of veneration, who are guided through realization, who are guided through manifesting various miracles and emanations, and who are guided through manifesting the perception of countless miracles and emanations, through the power of their aspirations, the power of the time, the power of turning them away from bad actions, the power of establishing them in the accomplishment of good actions, the power of accomplishing the karma of great prayers of the past, the power of the might of omniscience, the power of the qualities of attaining the miraculous manifestations of vast bodhisattva liberations, the power of the arising of the strength of great compassion that creates a refuge for all beings, and the power of the aspiration that creates a pure ocean of great love.

source: དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཡང་དག་པར་བླང་བའི་ཕྱིར་རབ་ཏུ་འཇུག་གོ །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱས་པས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགེ་བའི་རྩ་བ་ལ་ཡང་དག་པར་བསྐུལ་ལ་རབ་ཏུ་གནས་ཏེ། རྣམ་པར་དབྱེ་བ་མྱེད་པའི་ཆོས་ལ་ཞུགས་ནས་མཐའ་དང་དབུས་མེད་པའི་ལུས་ཀྱི་ཁ་དོག་དང་དབྱིབས་ཡོངས་སུ་བསྟན་ཏེ། སྤྱོད་པའི་ལུས་རེ་རེ་ལས་མཐའ་དང་དབུས་མེད་པའི་ཁ་དོག་རྒྱ་མཚོ་འཇིག་རྟེན་དུ་རྣམ་པར་དམྱིགས་པར་བྱས་ཏེ། སྤྱོད་པའི་ཁ་དོག་རེ་རེ་ལས་མཐའ་དང་དབུས་མེད་པའི་འོད་གཟེར་གྱི་སྤྲིན་ཡོངས་སུ་བཀྱེ་ཞིང་འོད་གཟེར་རེ་རེ་ལས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་གི་གཟུགས་བརྙན་མཐའ་དང་དབུས་མེད་པ་ཡོངས་སུ་བསྟན་ནས། སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེར་ཡང་དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་མཐའ་དང་དབུས་མེད་པ་ཡོངས་སུ་བསྟན་ཏེ། དེ་བཞིན་གཤེགས་པ་རེ་རེ་ཞིང་ཡང་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་མཐའ་དང་དབུས་མེད་པ་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་སྔོན་གྱི་དགེ་བའི་རྩ་བས་ཡང་དག་པར་བསྐུལ་བ་བྱེད་དོ། །དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་རྣམས་ཀྱང་ཡོངས་སུ་བསྐྱེད་དོ། །བསྐྱེད་པ་རྣམས་ཀྱང་ཡངས་པར་བྱེད་དོ། །དགེ་བའི་རྩ་བ་ཡངས་པར་བྱས་པ་རྣམས་ནི་རྣམ་པར་འཕེལ་བར་བྱེད་དེ།
en: “Noble one, in that way I am established in this bodhisattva liberation called the origin of the roots of merit that inspire the ripening of all beings , and comprehending the true nature of phenomena to be without division, I manifest the shapes and colors of bodies without limit or center, and from each manifested body come the perceptions within worlds of an endless and centerless ocean of colors, and from each manifested color clouds of light rays without limit or center are radiated, and from each light ray the images of buddha realms without limit or center are manifested, and in each buddha realm tathāgatas without limit or center are manifested, and each tathāgata manifests buddha miracles without limit or center, and thus I inspire those who have past roots of merit, and I cause those who have not generated roots of merit to generate them, those who have generated them to increase them, and those who have increased them to make them vast.

source: ཁོ་མོ་ནི་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་། སེམས་ཅན་ཀྱི་ཁམས་མཐའ་དང་དབུས་མེད་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་རབ་ཏུ་འགོད་པར་བྱེད་དོ།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: “In each instant of mind, I establish realms of beings without limit or center on the level of irreversible progress toward the highest, complete enlightenment.

source: བམ་པོ་བཅུ་གཉིས་པ། རིགས་ཀྱི་བུ་གཞན་ཡང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ་སྨྲས་ཏེ། ཁྱོད་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་ནས་ནི་ཇི་སྲིད་ཅིག་ལོན།
en: “Moreover, noble one, you asked, ‘How long has it been since you entered upon attaining the highest, complete enlightenment?

source: བསྐལ་པ་བརྒྱ་ཕྲག་ཇི་སྙེད་ཅིག་ནས་ནི་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་ལ་སྤྱོད་སྤྱོད་ཅེས་ཟེར་བ་དེའི་དོན་ཀྱང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བསྟན་པར་བྱའོ།
en: For how many hundreds of kalpas have you been practicing bodhisattva conduct?’ Through the blessing of the buddhas I will teach you the answer.

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་ནི་རྟོག་པ་དང་། རྣམ་པར་རྟོག་པའི་ཡུལ་དང་ལྡན་པ། དེ་ལ་འཁོར་བ་རིང་བ་འམ། འཁོར་བ་ཐུང་བར་རྣམ་པར་དགོད་ཅིང་བརྗོད་པར་བྱ་བ་བྱེད་དོ། །བསྐལ་པ་ཀུན་ནས་ཉོན་མོངས་པའམ། བསྐལ་པ་རྣམ་པར་དག་པའམ།
en: “Noble one, the domain of wisdom of the bodhisattvas is a field of perception without thoughts, concepts, or assumptions. There is no establishment or description of saṃsāra as being long or being short.

source: བསྐལ་པ་ཆུང་བའམ། བསྐལ་པ་ཆེ་བའམ། བསྐལ་པ་མང་བའམ། བསྐལ་བ་ཐ་དད་པའམ། བསྐལ་བ་རྣམ་པ་སྣ་ཚོགས་སུ་བྱ་བའམ། བསྐལ་པ་རྣམ་པ་ཐ་དད་པར་བྱ་བར་ཡང་རྣམ་པར་དགོད་པ་དང་། བརྗོད་པར་བྱ་བ་མྱེད་དོ།
en: There is no establishment or description of defiled kalpas, pure kalpas, short kalpas, great kalpas, numerous kalpas, differing kalpas, a variety of kalpas, or irregular kalpas.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་ནི་རང་བཞིན་གྱི་ངོ་བོ་ཉིད་ཀྱིས་ཡོངས་སུ་དག་པ་སྟེ། འདུ་ཤེས་ཀྱི་དྲ་བ་ཐམས་ཅད་དང་བྲལ་བ་སྒྲིབ་པའི་རི་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པའི་བསམ་པ་ལ་ཡོངས་སུ་འཆར་ཏེ། དེའང་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་དུས་སུ་འདུལ་བ་ཇི་ལྟ་བ་བཞིན་དུ་སྣང་བར་བྱེད་དོ།
en: Noble one, the domain of wisdom of the bodhisattvas naturally has a completely pure nature, is free of all nets of conceptualization, has transcended all the mountains of obscurations, and, arising in their aspirations, illuminates all beings whom it is time to ripen and guide accordingly.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ།
en: “Noble one, it is like this:

source: ཉི་མའི་དཀྱིལ་འཁོར་ལ་ཉིན་མཚན་གྱི་གྲངས་སུ་བྱ་བ་མྱེད་དེ། མི་སྲིད་ཀྱང་ཉི་མའི་དཀྱིལ་འཁོར་ནུབ་ན་ནི་ནུབ་མོར་སྣང་ངོ་། །ཉི་མའི་དཀྱིལ་འཁོར་ཤར་ན་ནི་ཉིན་བར་དུ་སྣང་ཞིང་བརྗོད་པ་ཡོད་དོ།
en: the disk of the sun itself has no enumeration of and does not exist as days and nights, but when it sets, that is perceived as sunset, and when the disk of the sun rises, that is said to be daytime.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་རྟོག་པ་མེད་པ་ལ་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་མྱེད་དེ།
en: “Noble one, in that way, in the domain of wisdom of the bodhisattvas there are no thoughts, concepts, or assumptions;

source: འཁོར་བ་ན་གནས་པའི་འདུ་ཤེས་ཀྱི་རྣམ་པ་ཐམས་ཅད་དང་། དུས་སུ་བྱ་བ་ཐམས་ཅད་ཀྱང་མེད་མོད་ཀྱི།
en: there are also no perceptions of residing in saṃsāra and no division into times.

source: འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ལས་བྱུང་བའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་རྟོག་པ་མེད་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་དུས་ཀྱི་དབང་གིས་བསྐལ་པར་གནས་པ་དང་། འཁོར་བའི་འདུ་ཤེས་ཀྱི་རྣམ་པར་བགྲང་བའི་གྲངས་སུ་བགྲང་བ་ཡིན་ཏེ།
en: However, through the power of the time for ripening all beings, that domain of wisdom without concepts that arises from the aspiration of the bodhisattvas has the enumeration of numbers concerning the duration of kalpas and the perceptions of saṃsāra.

source: ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་རྟོག་པ་མེད་པ་ལ་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་བསྐུལ་པར་གནས་པའི་འདུ་ཤེས་ཀྱི་རྣམ་པར་བགྲང་བ་ཡོད་དོ།
en: There is the enumeration of the duration of past and future kalpas in the conceptless domain of wisdom.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན། ཉི་མའི་དཀྱིལ་འཁོར་ནི་ནམ་མཁའི་དབྱིངས་ལ་འདུག་ཀྱང་། རིན་པོ་ཆེའི་རི་ཐམས་ཅད་དང་། རིན་པོ་ཆེའི་ཤིང་ཐམས་ཅད་དང་། རིན་པོ་ཆེའི་སྣོད་ཐམས་ཅད་དང་། རིན་པོ་ཆེའི་འབྱུང་གནས་ཐམས་ཅད་དང་། རྒྱ་མཚོ་ཐམས་ཅད་དང་། མཚོ་དང་མཚེའུ་ཐམས་ཅད་དང་། ཆུ་དང་བའི་སྣོད་ཐམས་ཅད་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་ལ་གཟུགས་བརྙན་རྣམ་པར་དམྱིགས་པ་སྣང་སྟེ།
en: “Noble one, it is like the analogy of the disk of the sun in the realm of space, which appears as a perceived image on all jewel mountains, all jewel trees, all jewel vessels, all jewel quarries, all oceans, all lakes and ponds, in all bowls of water, and to all beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་དུ་གྱུར་པར་སྣང་ངོ་།
en: It appears as a direct perception for all beings.

source: །རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ལ་ཉི་མའི་དཀྱིལ་འཁོར་གྱི་གཟུགས་བརྙན་བྱུང་བར་སྣང་ཡང་། ཉི་མའི་དཀྱིལ་འཁོར་དེ་ནི་རིན་པོ་ཆེའི་རི་རྣམས་ལའང་གནས་པ་མྱེད་དོ། །རིན་པོ་ཆེའི་ཤིང་ནས་རིན་པོ་ཆེའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམས་ཀྱི་བར་དུའང་ཞུགས་པ་མེད། རིན་པོ་ཆེའི་འབྲུ་རྣམས་ཀྱི་ཁོངས་སུ་ཆུད་པའང་མ་ཡིན། རིན་པོ་ཆེའི་འབྱུང་གནས་རྣམས་ཀྱི་རྗེས་སུ་སོང་བའང་མ་ཡིན། རྒྱ་མཚོ་རྣམས་ཀྱི་ནང་དུ་སོང་བའང་མ་ཡིན། ཆུའི་སྣོད་ཐམས་ཅད་ཀྱི་ནང་དུ་ཞུགས་པ་ཡང་མ་ཡིན་མོད་ཀྱི།
en: The image of the disk of the sun appears in the atoms of all jewels, but the disk of the sun is not present in the mountains of jewels, does not enter the jewel trees, and so on, up to atoms of jewels, is not contained within precious stones, does not come to jewel quarries, does not enter oceans, and does not go into bowls of water, yet it appears within them.

source: ཐམས་ཅད་ཀྱི་ཁོངས་ན་འདུག་པར་ཡང་སྣང་ངོ་། །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་འཁོར་བའི་རྒྱ་མཚོ་ལས་ནི་གྱེན་དུ་འཕགས། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ནམ་མཁའ་ལ་ནི་མངོན་པར་བྱུང་། ཆོས་ཀྱི་རང་བཞིན་ནམ་མཁའི་རྒྱུད་ལ་ནི་རྒྱུ་ཞིང་སྤྱོད།
en: “Noble one, in that same way, bodhisattva mahāsattvas have risen high above the ocean of saṃsāra and are in the sky of the realm of Dharma of the tathāgatas, active within the field of activity that is the sky of the nature of phenomena, and dwell in the realm of the sky of peace.

source: ཞི་བའི་ནམ་མཁའི་དབྱིངས་ལ་ནི་གནས་པར་གྱུར་མོད་ཀྱི་སྲིད་པའི་ལམ་གྱི་རྒྱུད་དང་། སྐྱེ་གནས་ཐམས་ཅད་དུའང་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བའི་དོན་དུ་སེམས་ཅན་ཐམས་ཅད་དང་འདྲ་བའི་ལུས་སུ་སྐྱེ་བར་སྣང་སྟེ། འཁོར་བའི་ཉེས་པས་གོས་པར་མི་འགྱུར་རོ། །སྐྱེ་བ་དང་འཆི་འཕོ་བའི་སྡུག་བསྔལ་གྱིས་ཉེ་བར་གདུང་བ་མེད་དོ། །རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་དག་དང་། འགྲོགས་པ་མེད་དོ། །བསྐལ་པ་ལའང་རིང་བའི་འདུ་ཤེས་སམ། ཐུང་བའི་འདུ་ཤེས་སུ་འགྱུར་བ་མེད་དོ།
en: However, in order to ripen and guide all beings in all the paths of existence and births, they appear in bodies that are the same as those of all beings, but without being stained by the faults of saṃsāra, without being accompanied by thoughts and concepts, without the perception of a kalpa being long, and without the perception of a kalpa being short.
